In [1]:
# https://dplyr.tidyverse.org/reference/tibble.html
# https://tibble.tidyverse.org/reference/tribble.html

from datar import f
from datar.tibble import tibble, tribble
from datar.base import diag
from datar.stats import runif

In [2]:
a = range(5)
tibble(a, f.a*2)

   a  f.a*2
0  0      0
1  1      2
2  2      4
3  3      6
4  4      8

In [3]:
tibble(a, b=f.a * 2, c=1)

   a  b  c
0  0  0  1
1  1  2  1
2  2  4  1
3  3  6  1
4  4  8  1

In [4]:
runif(10).shape

(10,)

In [5]:
tibble(x=runif(10), y=f.x*2)

          x         y
0  0.907413  1.814827
1  0.531231  1.062462
2  0.271175  0.542350
3  0.006298  0.012596
4  0.242987  0.485974
5  0.314747  0.629494
6  0.328753  0.657506
7  0.693651  1.387301
8  0.315403  0.630806
9  0.809689  1.619377

In [6]:
from datar.core.exceptions import NameNonUniqueError
x = 1
try:
    tibble(x, x)
except NameNonUniqueError as err:
    print(err)

Names must be unique: x

In [7]:
tibble(x, x, _name_repair="unique")

[2021-04-03 01:01:05][datar][WARNING] New names:
[2021-04-03 01:01:05][datar][WARNING] * 'x' -> 'x__0'
[2021-04-03 01:01:05][datar][WARNING] * 'x' -> 'x__1'

   x__0  x__1
0     1     1

In [8]:
tibble(x, x, _name_repair="minimal") # duplicated columns collapse

   x  x
0  1  1

In [9]:
a = 1
tibble(a * 1, a * 2, _name_repair="universal")

[2021-04-03 01:01:05][datar][WARNING] New names:
[2021-04-03 01:01:05][datar][WARNING] * 'a * 1' -> 'a___1'
[2021-04-03 01:01:05][datar][WARNING] * 'a * 2' -> 'a___2'

   a___1  a___2
0      1      2

In [10]:
from typing import Iterable
def make_unique(names: Iterable[str]):
    new_names = []
    for name in names:
        name_count = new_names.count(name)
        if name_count == 0:
            new_names.append(name)
        else:
            new_names.append(f'{name}_{name_count}')
    return new_names

tibble(a, a, _name_repair=make_unique)

   a  a_1
0  1    1

In [11]:
def fix_names(name):
    import re
    return re.sub(r'\s+', '_', name)


tibble(a + 1, a + 2, _name_repair = fix_names)

   a_+_1  a_+_2
0      2      3

In [12]:
tibble(x, x, _name_repair=["a", "b"])

   a  b
0  1  1

In [13]:
tibble(
  tibble(
    b = [4,5,6],
    c = [7,8,9]
  ),
  a = range(3),
  d = f.b
)

   b  c  a  d
0  4  7  0  4
1  5  8  1  5
2  6  9  2  6

In [14]:
s = tibble(diag(1, 4))
t = tibble(s.iloc[:, :2], _name_repair=['x', 'y'])
tibble(
  a=range(4),
  b=s,
  c=t
)

   a  b$0  b$1  b$2  b$3  c$x$0  c$x$1
0  0    1    0    0    0      1      0
1  1    0    1    0    0      0      1
2  2    0    0    1    0      0      0
3  3    0    0    0    1      0      0

In [15]:
try:
    tibble(a=range(3), b=range(4))
except ValueError as err:
    print(err)

Length of values (4) does not match length of index (3)

In [16]:
tibble(_dotted = 3, _name_repair=lambda x: x.replace('_', '.'))

   .dotted
0        3

In [17]:
x = 3
tibble(x=1, y=f.x)

   x  y
0  1  1

In [18]:
tibble(x=1, y=x)

   x  y
0  1  3

In [19]:
tribble(
  f.colA, f.colB,
  "a",    1,
  "b",    2,
  "c",    3
)

  colA  colB
0    a     1
1    b     2
2    c     3

In [20]:
tribble(
  f.x,  f.y,
  "a",  [1,2,3],
  "b",  [4,5,6]
)

   x          y
0  a  [1, 2, 3]
1  b  [4, 5, 6]